# ---- Taps (External Repositories) ----
tap "homebrew/bundle"
tap "lotyp/homebrew-formulae"

# ---- CLI Tools (Standard Brew) ----
# Core & Dotfile Management
brew "git"
brew "gh"
brew "stow"
brew "coreutils"
brew "nano"
brew "tmux"
brew "topgrade"
brew "thefuck"
brew "lotyp/formulae/dockutil"

# System & Infrastructure
brew "podman"
brew "tailscale"
brew "mas"
brew "jq"
brew "tree"
brew "wget"
brew "ripgrep"
brew "htop"

# File System & Network
brew "bat"
#brew "croc"
brew "eza"
brew "httpie"
brew "ssh-copy-id"
brew "unar"
brew "zoxide"

# Search & Diff
brew "fd"
brew "fzf"
brew "git-delta"
brew "gnu-sed"
brew "grep"
brew "psgrep"
brew "the_silver_searcher"

# Languages & Development
brew "cmake"
brew "n"
#brew "ruby"
#brew "rust"
brew "shellcheck"

# Media & Misc
brew "ffmpeg"
brew "imagemagick"
brew "optipng"
brew "uni"
brew "webp"
brew "grip"
brew "bats-core"
brew "duti"

# ---- GUI Applications (Casks) ----
# Browsers & Communication
cask "brave-browser"
cask "slack"
cask "whatsapp"
#cask "discord"

# Editors & IDEs
cask "visual-studio-code"
cask "cursor"
cask "sublime-text"
cask "ghostty"
cask "alacritty"

# Utilities & Tools
cask "raycast"
cask "bitwarden"
cask "maccy"
cask "fork"
cask "nomachine"
cask "alfred"

# Media & Creative
cask "vlc"
cask "gimp"
cask "inkscape"
cask "texmaker"

# ---- Fonts ----
cask "font-fira-code"
cask "font-awesome-terminal-fonts"

